Repository: common-repository/mfp-mod-wp
Catalog: languages/mfp-languages-*.po
Languages: ru_ru

source: Settings
ru_ru: Настройки удаления

source: Attention! All plugin settings will be reset permanently!
ru_ru: Внимание! Все настройки плагина будут сброшены безвозвратно!

source: Are you sure you want to continue?
ru_ru: Вы уверены, что хотите продолжить?

source: Yes, reset all settings
ru_ru: Да, сбросить настройки

source: Configuration MFP mod WP
ru_ru: Настройки MFP mod WP

source: About the plugin
ru_ru: О плагине

source: Plugin MFP mod WP does two main functions: clean your source code from links, which can to slow down your blog and hides some articles such as version of the engine, links to wordpress.org etc. from the admintool.
ru_ru: Плагин MFP мод WP чистит ваш исходный код от ссылок, которые могут замедлить работу блога, скрывает из админки некоторые пункты, в частности, версию движка, ссылки на wordpress.org и т.д. Позволяет добавить в Консоль свой виджет, изменить текст в футере админ панели, изменить фоновое изображение и логотип страницы входа. Автоматически переводит в транскрипт имена загружаемых файлов, ссылок на новые записи и страницы.

source: The plugin is developed now, but opportunities of the plugin are constantly expanding..
ru_ru: Возможности плагина постоянно расширяются

source: <em>Attention!</em> Some options may cause unstable operation of your blog. If it’s so, then turn off the option or don’t use the plugin, if you do not sure. The plugin do not change your files, if it will be deactivated, that all settings will be reset.
ru_ru: <em>Внимание!</em> Некоторые опции могут вызвать нестабильную работу вашего блога. В этом случае отключите опцию, либо откажитесь от использования данного плагина, если вы в чем-то не уверены. Сам плагин физически не изменяет ваши файлы, после деактивации все настройки будут сброшены.

source: Donate to this plugin
ru_ru: Поддержать автора

source: Reset all settings
ru_ru: Сбросить все настройки

source: Settings removal
ru_ru: Настройки удаления

source: Removing comments from the code:
ru_ru: Удаление комментариев из кода:

source: Removes comments html <br /> (type &lt;-- comment --&gt; ) with the source code. Does not alter any files!
ru_ru: Удаляет на лету комментарии html <br />(вида &lt;-- comment --&gt; ) из исходного кода. Не изменяет ваши файлы!

source: Hide WordPress version in JavaScript and CSS:
ru_ru: Скрыть версию WordPress в окончании файлов JavaScript and CSS:

source: Hides WordPress version with source code
ru_ru: Скрыть версию WordPress в исходном коде

source: Removing the shortcut menu help:
ru_ru: Удаление контекстного меню справки:

source: Hides in the admin panel context menu reference.
ru_ru: Скрывает в панели администратора контекстное меню справки.

source: Removing the logo and links in wp admin panel:
ru_ru: Удаление лого и ссылок в панели админа:

source: Removing the logo and links to wordpress.org with admin panel.
ru_ru: Удаление логотипа и ссылок на wordpress.org

source: Disabling the function emoji:
ru_ru: Отключение функции emoji

source: Functional emoji (emoticons) can adversely affect site speed.
ru_ru: Функционал emoji (смайлы) может отрицательно сказаться на скорости сайта.

source: Removing links from wp_head, slowing the work site
ru_ru: Удаление ссылок из блока wp_head, замедляющих работу сайта

source: Removing rss, rds:
ru_ru: Удалить rss, rds:

source: Links to rss, atom, trackbacks
ru_ru: Ссылки на rss, atom, trackbacks

source: Removing wlwmanifest:
ru_ru: Удалить wlwmanifest:

source: Link to editor Windows Live Writer
ru_ru: Ссылка на редактор Windows Live Writer

source: Removing relink pages:
ru_ru: Удалить перелинковку страниц, создающих проблемы СЕО:

source: Removes rel="canonical":
ru_ru: Удаление rel="canonical":

source: In some cases this can cause problems with indexing pages. Activate, if you know what you are doing.
ru_ru: В некоторых случая это может вызвать проблемы с индексацией страниц. Активируйте, если понимаете, что делаете.

source: Removing wp_shortlink:
ru_ru: Удалить wp_shortlink:

source: Removes duplicates links site.ru/?p=111
ru_ru: Удалить дубли ссылок вида site.ru/?p=111

source: Removing wp_generator:
ru_ru: Удалить wp_generator:

source: Removes WordPress version of html code
ru_ru: Удаление строки с версией WordPress

source: Removing widgets in the console
ru_ru: Удаление виджетов в консоли

source: Remove widget Quick Press:
ru_ru: Удалить виджет Быстрый черновик:

source: Remove widget Activity:
ru_ru: Удалить виджет Активность:

source: Remove widget Right now:
ru_ru: Удалить виджет На виду:

source: Remove widget News Wordpress:
ru_ru: Удалить виджет Новости Wordpress:

source: Remove widget Welcome:
ru_ru: Удалить виджет Добро пожаловать:

source: Transliteration while downloading the file, create a new record or page
ru_ru: Транслитерация при загрузке файла, создания новой записи или страницы

source: Enable transliteration:
ru_ru: Включить транслитерацию:

source: When you create a new entry link will automatically transferred to the transliteration. There will also be translated Cyrillic names of uploaded files.
ru_ru: Когда вы создаете новую запись, ссылка будет автоматически переведена в транслит. Также будут переведены кириллические имена загружаемых файлов.

source: Text in footer admin panel:
ru_ru: Текст в футере админ панели

source: Enable display text:
ru_ru: Включить отображения текста:

source: Enter the text link and the title links
ru_ru: Введите текст, ссылку и название ссылки

source: Metaboxes Console
ru_ru: Метабокс в Консоли

source: Enable Metaboxes:
ru_ru: Включить метабокс

source: Adding a metaboxes (widget)<br/> to the Console
ru_ru: Добавление метабокса (виджета) в Консоль

source: Title widget
ru_ru: Заголовок виджета

source: The main text of the widget
ru_ru: Основной текст виджета

source: Changing the appearance of the login page
ru_ru: Изменение внешнего вида страницы входа

source: Make beautiful:
ru_ru: Сделать красиво:

source: background image
ru_ru: фоновое изображение

source: Select background
ru_ru: Выбрать фон

source: logo
ru_ru: логотип

source: Select logo
ru_ru: Выбрать логотип

source: Save Configuration
ru_ru: Сохранить настройки
